       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EM03-01.
       AUTHOR.        LEANDRO & EDEL.
       INSTALLATION.  CASA.
       DATE-WRITTEN.  03/10/2013.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.       LE ARQUIVO CADENT E GERA ARQUIVO CADSAI
      *               CLASSIFICADO EM ORDEM ASCENDENTE PELO 
      *               CAMPO CODIGO E NOME.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT ENTRADA ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT SAIDA ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD ENTRADA
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "ENTRADA.DAT".

       01 REG-ENT.
         02 COD-ENT   PIC 9(05).
         02 NOME-ENT  PIC X(30).
         02 SEXO-ENT  PIC X(01).

       SD TRAB.
       01 REG-TRAB.
         02 COD-TRAB  PIC 9(05).
         02 NOME-TRAB PIC X(30).
         02 SEXO-TRAB PIC X(01).

       FD SAIDA
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "SAIDA.DAT".

       01 REG-SAI.
         02 COD-SAI  PIC 9(05).
         02 NOME-SAI PIC X(30).
         02 SEXO-SAI PIC X(01).
       
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       EX01.

       SORT TRAB
              ASCENDING KEY COD-TRAB
              ASCENDING KEY NOME-TRAB
              USING ENTRADA
              GIVING SAIDA
       STOP RUN.