       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EXERCICIO4.
       AUTHOR.        EDEL CORADI.
       INSTALLATION.   PC-CASA.
       DATE-WRITTEN.  30/10/2013.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.       SORT-USING-OUTPUT.
      *               SELECIONA CADASTRO E FAZ SORTE USANDO UM PROCEDURE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CAD-CLI   ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.
       SELECT TRAB      ASSIGN TO DISK.
       SELECT REL-GERAL ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       FD CAD-CLI
          LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "CAD-CLI.DAT".

       01 CAD-ENT.
         02 CODIGO-ENT   PIC 9(03).
         02 CPF-ENT      PIC 9(11).
         02 NOME-ENT     PIC X(30).
         02 ESTADO-ENT   PIC X(02).
         02 CIDADE-ENT   PIC X(30).
         02 EMAIL-ENT    PIC X(30).

       SD TRAB.

       01 CAD-TRAB.
         02 CODIGO-TRAB  PIC 9(03).
         02 CPF-TRAB     PIC 9(11).
         02 NOME-TRAB     PIC X(30).
         02 ESTADO-TRAB  PIC X(02).
         02 CIDADE-TRAB  PIC X(30).
         02 EMAIL-TRAB   PIC X(30).

       FD REL-GERAL
         LABEL RECORD ARE OMMITED.

       01 REL-GRL        PIC X(80).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ        PIC 9(01) VALUE 0.
       77 CT-LIN         PIC 9(02) VALUE 21.
       77 CT-PAG         PIC 9(02) VALUE 0.
       77 ESTADO-ATUAL   PIC X(02).
       77 CIDADE-ATUAL   PIC X(30).

       01 CAB-01.
         02 FILLER      PIC X(23) VALUE SPACES.
         02 FILLER      PIC X(37) VALUE 
          "RELAÇÃO DE CLIENTES POR ESTADO/CIDADE".
         02 FILLER      PIC X(05) VALUE SPACES.
         02 FILLER      PIC X(05) VALUE "PAG. ".
         02 VAR-PAG     PIC ZZ9.
         02 FILLER      PIC X(07) VALUE SPACES.

       01 CAB-02.
         02 FILLER      PIC X(08) VALUE "ESTADO: ".
         02 ESTADO-REL  PIC X(02).
         02 FILLER      PIC X(70) VALUE SPACES.
         
       01 CAB-03.
         02 FILLER      PIC X(08) VALUE "CIDADE: ".
         02 CIDADE-REL  PIC X(30).
         02 FILLER      PIC X(42) VALUE SPACES.

       01 CAB-04.
         02 FILLER      PIC X(03) VALUE "CPF".
         02 FILLER      PIC X(24) VALUE SPACES.
         02 FILLER      PIC X(04) VALUE "NOME".
         02 FILLER      PIC X(20) VALUE SPACES.
         02 FILLER      PIC X(06) VALUE "E-MAIL". 
         02 FILLER      PIC X(23) VALUE SPACES.

       01 DETALHE.
         02 CPF-REL     PIC X(14) VALUE "999.999.999-99".
         02 FILLER      PIC X(03) VALUE SPACES.
         02 NOME-REL    PIC X(30).
         02 FILLER      PIC X(03) VALUE SPACES.
         02 EMAIL-REL   PIC X(30).

       PROCEDURE DIVISION.
       PGM-04.

       SORT TRAB
                ASCENDING KEY ESTADO-TRAB
                ASCENDING KEY CIDADE-TRAB
                ASCENDING KEY CPF-TRAB
                USING CAD-CLI
                OUTPUT PROCEDURE GERA-RELATORIO
       STOP RUN.

       GERA-RELATORIO SECTION.
              PERFORM INICIO.
              PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL 1.
              PERFORM FIM.

       INICIO SECTION.
              OPEN INPUT CAD-CLI OUTPUT REL-GERAL.
              PERFORM VERIFICA-FIM.
       
       VERIFICA-FIM SECTION.
              RETURN TRAB AT END MOVE 1 TO FIM-ARQ.

       PRINCIPAL SECTION.
              IF ESTADO-ATUAL NOT EQUAL ESTADO-TRAB
                 MOVE ESTADO-TRAB  TO ESTADO-ATUAL
                 MOVE ESTADO-ATUAL TO ESTADO-REL
                 PERFORM CABECALHO-ESTADO
              END-IF

              IF CIDADE-ATUAL NOT EQUAL CIDADE-TRAB
                 MOVE CIDADE-TRAB TO CIDADE-ATUAL
                 MOVE CIDADE-ATUAL TO CIDADE-REL
                 PERFORM CABECALHO-CIDADE
              END-IF

              PERFORM IMPRESSAO.
              IF CT-LIN GREATER THAN 20 PERFORM CABECALHO-CIDADE.
              PERFORM VERIFICA-FIM.

       CABECALHO-ESTADO SECTION.
              ADD 1 TO CT-PAG.
              MOVE CT-PAG TO VAR-PAG.
              MOVE SPACES TO REL-GRL.
              WRITE REL-GRL AFTER ADVANCING PAGE.
              WRITE REL-GRL FROM CAB-01 AFTER ADVANCING 1 LINE.
              WRITE REL-GRL FROM CAB-02 AFTER ADVANCING 2 LINES.

       CABECALHO-CIDADE SECTION.
              WRITE REL-GRL FROM CAB-03 AFTER ADVANCING 2 LINES.
              WRITE REL-GRL FROM CAB-04 AFTER ADVANCING 2 LINES.
              
              MOVE 0 TO CT-LIN.

       IMPRESSAO SECTION.
              MOVE CPF-TRAB   TO CPF-REL.
              MOVE NOME-TRAB  TO NOME-REL.
              MOVE EMAIL-TRAB TO EMAIL-REL.
              WRITE REL-GRL FROM DETALHE AFTER ADVANCING 1 LINE.
              ADD 1 TO CT-LIN.

       FIM SECTION.
              CLOSE CAD-CLI REL-GERAL.
           
