       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EXERCICIO3.
       AUTHOR.        LEANDRO & EDEL.
       INSTALLATION.  CASA.
       DATE-WRITTEN.  14/10/2013.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.       LE CADENT, FAZ UM SORT PELO CAMPO CODIGO
      *               EM ORDEM ASCENDENTE APENAS DOS DEPARTAMENTOS
      *               01 E 02.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CADENT ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.
       SELECT TRAB ASSIGN TO DISK.
       SELECT CADSAI ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADENT
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "CADENT.DAT".

       01 REG-ENT.
         02 CODIGO-ENT   PIC 9(05).
         02 NOME-ENT     PIC X(30).
         02 DEPT-ENT     PIC 9(02).

       SD TRAB.
        
       01 REG-TRAB.
         02 CODIGO-TRAB  PIC 9(05).
         02 NOME-TRAB    PIC X(30).
         02 DEPT-TRAB    PIC 9(02).

       FD CADSAI
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "CADSAI.DAT".

       01 REG-SAI.
         02 CODIGO-SAI   PIC 9(05).
         02 NOME-SAI     PIC X(30).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ        PIC 9(01) VALUE 0.

       PROCEDURE DIVISION.
       PROGRAMA03.

       SORT TRAB
            ASCENDING KEY CODIGO-TRAB
            USING CADENT
            OUTPUT PROCEDURE SAIDA
       STOP RUN.

       SAIDA SECTION.
              PERFORM INICIO.
              PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL 1.
              PERFORM FIM.

       INICIO SECTION.
              OPEN OUTPUT CADSAI.
              PERFORM VERIFICA-FIM.

       VERIFICA-FIM SECTION.
              RETURN TRAB AT END MOVE 1 TO FIM-ARQ.

       PRINCIPAL SECTION.
              PERFORM SELECAO.
              PERFORM VERIFICA-FIM.

       SELECAO SECTION.
              IF DEPT-TRAB EQUAL 01 OR 02 PERFORM GRAVACAO.

       GRAVACAO SECTION.
              MOVE CODIGO-TRAB TO CODIGO-SAI.
              MOVE NOME-TRAB TO NOME-SAI.
              WRITE REG-SAI.

       FIM SECTION.
              CLOSE CADSAI.
