       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TABELA.
       AUTHOR.        EDEL E LEANDRO.
       INSTALLATION.  FATEC-SP.
       DATE-WRITTEN.  17/10/2013.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS.       USANDO O REMARKS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
        SELECT CADPAG ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.
        SELECT CADREC ASSIGN TO DISK ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADPAG
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "CADPAG.DAT".

       01 TABELA-CADASTRO.
         02 CODIGO   PIC 9(05).
         02 NOME     PIC X(30).
         02 VALOR    PIC 9(05)V9(02) OCCURS 10 TIMES.

       FD CADREC
         LABEL RECORD ARE STANDARD VALUE OF FILE-ID IS "CADREC.DAT".

       01 REC.
         02 CODIGO-SAI   PIC 9(05).
         02 NOME-SAI     PIC X(30).
         02 TOTAL        PIC 9(05)V9(02).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ      PIC 9(01) VALUE 0.
       77 CTR          PIC 9(02).

       PROCEDURE DIVISION.
       PGM-01.

       PERFORM INICIO.
       PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL 1.
       PERFORM FIM.
       STOP RUN.

       INICIO.
              OPEN INPUT CADPAG OUTPUT CADREC.
              PERFORM VERIFICA-FIM.

       VERIFICA-FIM.
              READ CADPAG AT END MOVE 1 TO FIM-ARQ.

       PRINCIPAL.
              MOVE 1 TO CTR.
              MOVE 0 TO TOTAL.
              PERFORM ACUMULA-TABELA 10 TIMES.
              PERFORM EXIBE-TOTAL.
              PERFORM GRAVACAO.
              PERFORM VERIFICA-FIM.

       ACUMULA-TABELA.
              ADD VALOR(CTR) TO TOTAL.
              ADD 1 TO CTR.

       EXIBE-TOTAL.
              DISPLAY TOTAL.

       GRAVACAO.
              MOVE CODIGO TO CODIGO-SAI.
              MOVE NOME TO NOME-SAI.
              WRITE REC.      

       FIM.
              CLOSE CADPAG CADREC.
